// Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.
// 14 -> нет 
// 46 -> нет 
// 161 -> да

// Console.WriteLine("Введите первое число: ");
// int number1 = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите второе число: ");
// int number2 = Convert.ToInt32(Console.ReadLine());

// if (number1 % number2 == 0)
// {
    // Console.WriteLine("Число кратное");
// }
// else
// {
    // Console.WriteLine("Остаток от деления: " + (number1 % number2));
// }

int num1 = 2;
int num2 = 3;
Console.WriteLine(num1 == 2 && num2 == 3);